Revit 2027 API
UnitFormatUtils Class
 A utility class for formatting and parsing numbers with units.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UnitFormatUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class UnitFormatUtils
Public NotInheritable Class UnitFormatUtils
public ref class UnitFormatUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UnitFormatUtils = class end
The UnitFormatUtils type exposes the following members.
Methods
Name | Description
Format(Units, ForgeTypeId, Double, Boolean) |  Formats a number with units into a string.
Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions) |  Formats a number with units into a string.
TryParse(Units, ForgeTypeId, String, Double) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, Double, String) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double, String) |  Parses a formatted string into a number with units if possible.
Top
See Also
Reference
Autodesk.Revit.DB Namespace